# Pandas CheatSheet

In [1]:
import pandas as pd

## Series
A one-dimensional labeled array capable of holding any data type

In [2]:
s = pd.Series([3, -5, 7, 4])
s

0    3
1   -5
2    7
3    4
dtype: int64

In [3]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

## DataFrame
A two-dimensional labeled data structure with columns of potentially different types

In [4]:
data = {'Country': ['Belgium', 'India', 'Brazil'],
'Capital': ['Brussels', 'New Delhi', 'Brasília'],
'Population': [11190846, 1303171035, 207847528]}

In [5]:
df = pd.DataFrame(data)
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [6]:
df = pd.DataFrame(data,
columns=['Country', 'Capital', 'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

## Selection
__Getting__

In [7]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [8]:
s['b']

-5

In [9]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [10]:
df[1:]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

In [11]:
df[:1]

   Country   Capital  Population
0  Belgium  Brussels    11190846

In [12]:
df[1:2]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [13]:
df[1:-1]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [14]:
df[0:-1]

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035

## Selecting, Setting
__By Position__


loc: only work on index

iloc: work on position

at: get scalar values. It's a very fast loc

iat: get scalar values. It's a very fast iloc

In [15]:
df.iloc[[0]]

   Country   Capital  Population
0  Belgium  Brussels    11190846

In [16]:
df.loc[0]

Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object

In [17]:
df.iloc[[0],[0]]

   Country
0  Belgium

In [18]:
#df.loc[0,0] raises error

In [19]:
df.loc[[0,0]]

   Country   Capital  Population
0  Belgium  Brussels    11190846
0  Belgium  Brussels    11190846

In [20]:
df.iat[0,0]

'Belgium'

__By Label__

In [21]:
df.loc[[0], ['Country']]

   Country
0  Belgium

In [22]:
df.iloc[[0], [0]]

   Country
0  Belgium

In [23]:
df.at[0,'Country']

'Belgium'

__Boolean Indexing__

In [24]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [25]:
s[~(s > 1)]

b   -5
dtype: int64

In [26]:
s[(s < -1) | (s > 5)]

b   -5
c    7
dtype: int64

__Setting__

In [27]:
s['a'] = 6
s

a    6
b   -5
c    7
d    4
dtype: int64

## Dropping

In [28]:
s.drop(['a', 'c'])

b   -5
d    4
dtype: int64

In [29]:
s

a    6
b   -5
c    7
d    4
dtype: int64

In [30]:
s = s.drop(['a', 'c'])
s

b   -5
d    4
dtype: int64

In [31]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [32]:
df.drop('Country', axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [33]:
#df.drop('Country', axis=0) # gives error: ['Country'] not found in axis

## Sorting

In [34]:
df.sort_index()

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [35]:
df.sort_values(by='Country')

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [36]:
df.sort_values('Capital', ascending=False)

   Country    Capital  Population
1    India  New Delhi  1303171035
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528

## Retrieving Series/DataFrame Information

In [37]:
df.shape

(3, 3)

In [38]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [39]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [41]:
df.head(2)

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035

In [42]:
df.tail(1)

  Country   Capital  Population
2  Brazil  Brasília   207847528

In [43]:
df.sample()

   Country   Capital  Population
0  Belgium  Brussels    11190846

In [44]:
df.sample(n=2, random_state=1)

   Country   Capital  Population
0  Belgium  Brussels    11190846
2   Brazil  Brasília   207847528

In [45]:
df['Country'].sample(n=2, random_state=1)

0    Belgium
2     Brazil
Name: Country, dtype: object

In [46]:
df.count()

Country       3
Capital       3
Population    3
dtype: int64

In [47]:
df.value_counts()

Country  Capital    Population
Belgium  Brussels   11190846      1
Brazil   Brasília   207847528     1
India    New Delhi  1303171035    1
dtype: int64

In [48]:
s

b   -5
d    4
dtype: int64

In [49]:
s.value_counts()

-5    1
 4    1
dtype: int64

## Statistics

In [50]:
df.sum()

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasília
Population                   1522209409
dtype: object

In [51]:
df.min()

Country        Belgium
Capital       Brasília
Population    11190846
dtype: object

In [52]:
df.max()

Country            India
Capital        New Delhi
Population    1303171035
dtype: object

In [53]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [54]:
df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [55]:
df.mean()

/var/folders/v6/_tx89b9n2l51thmyq84j4tpm0000gp/T/ipykernel_88367/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Population    5.074031e+08
dtype: float64

In [56]:
df['Population'].mean()

507403136.3333333

In [57]:
df.median()

/var/folders/v6/_tx89b9n2l51thmyq84j4tpm0000gp/T/ipykernel_88367/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Population    207847528.0
dtype: float64

In [58]:
df['Population'].median()

207847528.0

In [59]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

## Applying Functions

In [60]:
f = lambda x:x*2
df.apply(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606342070
2    BrazilBrazil    BrasíliaBrasília   415695056

In [61]:
df.apply(pd.Series.value_counts)

            Country  Capital  Population
11190846        NaN      NaN         1.0
207847528       NaN      NaN         1.0
1303171035      NaN      NaN         1.0
Belgium         1.0      NaN         NaN
Brasília        NaN      1.0         NaN
Brazil          1.0      NaN         NaN
Brussels        NaN      1.0         NaN
India           1.0      NaN         NaN
New Delhi       NaN      1.0         NaN

In [62]:
df['Population']

0      11190846
1    1303171035
2     207847528
Name: Population, dtype: int64

In [63]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [64]:
import numpy as np
df['Population'].apply(np.mean)

0    1.119085e+07
1    1.303171e+09
2    2.078475e+08
Name: Population, dtype: float64

## Data Alignment

In [65]:
s

b   -5
d    4
dtype: int64

In [66]:
s3 = pd.Series([7, -2, 3], index=['a', 'c', 'd'])
s3

a    7
c   -2
d    3
dtype: int64

In [67]:
s + s3

a    NaN
b    NaN
c    NaN
d    7.0
dtype: float64

In [68]:
s.add(s3,fill_value=0)

a    7.0
b   -5.0
c   -2.0
d    7.0
dtype: float64

In [69]:
s.sub(s3,fill_value=0)

a   -7.0
b   -5.0
c    2.0
d    1.0
dtype: float64

In [70]:
s.div(s3,fill_value=0)

a    0.000000
b        -inf
c   -0.000000
d    1.333333
dtype: float64

In [71]:
s.mul(s3,fill_value=0)

a     0.0
b    -0.0
c    -0.0
d    12.0
dtype: float64

## Data Cleaning

In [72]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [73]:
df.columns = ['Country', 'Capital of the Country', 'Population of the Country']

In [74]:
df.columns

Index(['Country', 'Capital of the Country', 'Population of the Country'], dtype='object')

In [75]:
df

   Country Capital of the Country  Population of the Country
0  Belgium               Brussels                   11190846
1    India              New Delhi                 1303171035
2   Brazil               Brasília                  207847528

In [76]:
df1 = df
df1.append(df)

   Country Capital of the Country  Population of the Country
0  Belgium               Brussels                   11190846
1    India              New Delhi                 1303171035
2   Brazil               Brasília                  207847528
0  Belgium               Brussels                   11190846
1    India              New Delhi                 1303171035
2   Brazil               Brasília                  207847528

In [77]:
df2 = df
pd.concat([df2,df],axis=0)

   Country Capital of the Country  Population of the Country
0  Belgium               Brussels                   11190846
1    India              New Delhi                 1303171035
2   Brazil               Brasília                  207847528
0  Belgium               Brussels                   11190846
1    India              New Delhi                 1303171035
2   Brazil               Brasília                  207847528

In [78]:
df3 = df
pd.concat([df3,df],axis=1)

,Country,Capital of the Country,Population of the Country,Country,Capital of the Country,Population of the Country
0,Belgium,Brussels,11190846,Belgium,Brussels,11190846
1,India,New Delhi,1303171035,India,New Delhi,1303171035
2,Brazil,Brasília,207847528,Brazil,Brasília,207847528

In [79]:
df1

   Country Capital of the Country  Population of the Country
0  Belgium               Brussels                   11190846
1    India              New Delhi                 1303171035
2   Brazil               Brasília                  207847528

In [80]:
df1['Country'][0] = np.nan

/var/folders/v6/_tx89b9n2l51thmyq84j4tpm0000gp/T/ipykernel_88367/352430978.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Country'][0] = np.nan

In [81]:
df1

  Country Capital of the Country  Population of the Country
0     NaN               Brussels                   11190846
1   India              New Delhi                 1303171035
2  Brazil               Brasília                  207847528

In [82]:
pd.isnull(df1)

   Country  Capital of the Country  Population of the Country
0     True                   False                      False
1    False                   False                      False
2    False                   False                      False

In [83]:
pd.notnull(df1)

   Country  Capital of the Country  Population of the Country
0    False                    True                       True
1     True                    True                       True
2     True                    True                       True

In [84]:
df1.dropna()

  Country Capital of the Country  Population of the Country
1   India              New Delhi                 1303171035
2  Brazil               Brasília                  207847528

In [85]:
df1

  Country Capital of the Country  Population of the Country
0     NaN               Brussels                   11190846
1   India              New Delhi                 1303171035
2  Brazil               Brasília                  207847528

In [86]:
df1.fillna(s.mean)

,Country,Capital of the Country,Population of the Country
0,<bound method NDFrame._add_numeric_operations....,Brussels,11190846
1,India,New Delhi,1303171035
2,Brazil,Brasília,207847528

In [87]:
s

b   -5
d    4
dtype: int64

In [88]:
s.replace(4,'four')

b      -5
d    four
dtype: object

## I/O

In [89]:
df.to_csv('myDataFrame.csv')

In [90]:
df_load = pd.read_csv( 'myDataFrame.csv', header=None)
df_load

     0        1                       2                          3
0  NaN  Country  Capital of the Country  Population of the Country
1  0.0      NaN                Brussels                   11190846
2  1.0    India               New Delhi                 1303171035
3  2.0   Brazil                Brasília                  207847528

In [91]:
df_load = pd.read_csv( 'myDataFrame.csv', nrows=5)
df_load

   Unnamed: 0 Country Capital of the Country  Population of the Country
0           0     NaN               Brussels                   11190846
1           1   India              New Delhi                 1303171035
2           2  Brazil               Brasília                  207847528

In [92]:
df.to_excel('myDataFrame.xlsx', sheet_name='Sheet1')

In [ ]:
df_load_xls = pd.read_excel('myDataFrame.xlsx')
df_load_xls

In [ ]:
dictionary = {'Country': ['Belgium', 'India', 'Brazil'],
'Capital': ['Brussels', 'New Delhi', 'Brasília'],
'Population': [11190846, 1303171035, 207847528]}
df = pd.DataFrame(dictionary)
df

## Reshaping Data

In [ ]:
df.rename(columns={'Population':'Number of People'})

In [ ]:
df.rename(index=lambda x:x*2)

In [ ]:
df.set_index('Country')

In [ ]:
df.reset_index()

In [ ]:
import numpy as np
pd.DataFrame(np.random.rand(4,5))

## Plotting

In [ ]:
ts = pd.Series(np.random.randn(100), index=pd.date_range('1/1/2022', periods=100))

In [ ]:
ts.plot()

In [ ]:
#np.random.randn(100, 4)

In [ ]:
df_plot = pd.DataFrame(np.random.randn(100, 4), index=ts.index, columns=list('ABCD'))

In [ ]:
df_plot = df_plot.plot()

In [ ]:
df3 = pd.DataFrame(np.random.randn(100, 2), columns=['B', 'C']).cumsum()

In [ ]:
list(range(len(df3)))

In [ ]:
df3['A'] = pd.Series(list(range(len(df3))))

In [ ]:
df3.plot(x='A', y='B')

In [ ]:
np.random.rand(10, 4)

In [ ]:
df2 = pd.DataFrame(np.random.rand(10, 4), columns=['a', 'b', 'c', 'd'])
df2.plot.bar();

In [ ]:
df4 = pd.DataFrame({'a': np.random.randn(100) + 2, 
                    'b': np.random.randn(100),
                    'c': np.random.randn(100) - 2}, 
                   columns=['a', 'b', 'c'])
df4.plot.hist(alpha=0.6)